app/controllers/books_controller.rb

SELECT "books".* FROM "books" ORDER BY "books"."created_at" DESC
---
  def index
      @Book = Book.new
      @books = Book.all.order(created_at: :desc)

SELECT "books".* FROM "books" ORDER BY "books"."created_at" DESC
INSERT INTO "books" ("title", "body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", " af"], ["body", " ad"], ["created_at", "2019-08-24 07:52:45.544794"], ["updated_at", "2019-08-24 07:52:45.544794"], ["user_id", 4]]
---
  def create
      @Book = Book.new(book_params)
      @Book.user_id = current_user.id
      @user = current_user
      @books = Book.all.order(created_at: :desc)

      if @Book.save

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "update_title_a"], ["body", "update_body_b"], ["updated_at", "2019-08-24 08:14:03.486396"], ["id", 1]]
UPDATE "books" SET "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["body", " dz ad"], ["updated_at", "2019-08-24 07:53:19.529388"], ["id", 1]]
---
  def update
      @book = Book.find(params[:id])
      @book.update(book_params)
      if @book.save