app/controllers/users_controller.rb

  def show
  	  @Book = Book.new
      @user = User.find(params[:id])
      @books = @user.books.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "books".* FROM "books" WHERE "books"."user_id" = ?  [["user_id", 2]]

  def index
      @Book = Book.new
  	  @users = User.all.order(created_at: :desc)
---
SELECT "users".* FROM "users" ORDER BY "users"."created_at" DESC