app/models/user.rb

  def self.find_first_by_auth_conditions(warden_conditions)
      conditions = warden_conditions.dup
      if login = conditions.delete(:login)
        #認証の条件式を変更する
        where(conditions).where(["name = :value", { :value => name }]).first
---
SELECT  "users".* FROM "users" WHERE "users"."name" = ? ORDER BY "users"."id" ASC LIMIT ?  [["name", "0000"], ["LIMIT", 1]]